kuvadi/GPDisplay/GPDisplay.ioc
MxCube.Version=6.2.0
PD4.GPIO_Label=LED4 [LD4 Blue Led]
PA1.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB15.GPIO_Speed=GPIO_SPEED_FREQ_LOW
Dma.SPI1_RX.0.Instance=DMA1_Channel2
PC9.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_16
PC1.GPIO_Label=MII_MDC [DP83848_MDC]
PA10.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PD4.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
VP_SYS_VS_Systick.Mode=SysTick
SH.ADCx_IN15.ConfNb=1
RCC.RCC_MCOSource=RCC_MCO1SOURCE_HSE
PD13.GPIO_PuPd=GPIO_NOPULL
PD5.GPIO_PuPd=GPIO_PULLUP
Dma.SPI1_RX.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
OSC_OUT.Locked=true
PA4.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE5.Locked=true
PC2.GPIO_PuPd=GPIO_NOPULL
PE6.Signal=SYS_TRACED3
PB15.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
RCC.IPParameters=ADCFreqValue,ADCPresc,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSEDivPLL,HSE_VALUE,I2S2Freq_Value,I2S3Freq_Value,MCOFreq_Value,PLL2CLKoutputFreqValue,PLL2VCOoutputFreqValue,PLL3CLKoutputFreqValue,PLL3VCOoutputFreqValue,PLLCLKFreq_Value,PLLMUL,Prediv1Source,Prediv2,Prediv2FreqValue,RCC_MCOSource,RTCClockSelection,RTCFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value,VCOOutput2Freq_Value
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F107V(B-C)Tx
PE0.Signal=GPIO_Input
Dma.SPI1_RX.0.MemInc=DMA_MINC_ENABLE
PA2.Signal=ETH_MDIO
PA13.GPIO_Label=TMS/SWDIO
PB2.Locked=true
FATFS._MAX_SS=4096
Mcu.IP8=SYS
Mcu.IP9=USART2
Mcu.IP6=SPI1
Mcu.IP7=SPI3
ProjectManager.CoupleFile=false
PB3.Signal=SPI1_SCK
RCC.SYSCLKFreq_VALUE=72000000
VP_USB_HOST_VS_USB_HOST_CDC_FS.Signal=USB_HOST_VS_USB_HOST_CDC_FS
PA1.Locked=true
PA12.Mode=Host_Only
KeepUserPlacement=false
VP_USB_HOST_VS_USB_HOST_CDC_FS.Mode=CDC_FS
PC5.GPIO_Label=VBAT_Voltage_OUT
PD13.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PA13.Locked=true
SH.GPXTI9.ConfNb=1
PA14.Signal=SYS_JTCK-SWCLK
PB2.GPIO_Label=LCD_CS
PC6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PA8.GPIO_PuPd=GPIO_NOPULL
ADC1.NbrOfConversionFlag=1
PB7.Locked=true
PB8.Signal=ETH_TXD3
PE3.GPIO_Label=TRACE_D0
PC9.Signal=GPIO_Output
PB8.GPIO_Mode=GPIO_MODE_AF_PP
PD9.Locked=true
RCC.APB1Freq_Value=36000000
PB8.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC12.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD7.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PB11.Locked=true
ProjectManager.DeviceId=STM32F107VCTx
PB12.Signal=ETH_TXD0
ProjectManager.LibraryCopy=1
PC3.GPIO_PuPd=GPIO_NOPULL
PD12.GPIO_PuPd=GPIO_NOPULL
PE1.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PA3.GPIO_Label=MII_COL [DP83848_COL]
PD6.GPIO_PuPd=GPIO_PULLUP
USB_HOST0.BSP.instance=PC9
PA6.Locked=true
isbadioc=false
